//一个机器人位于一个 m x n 网格的左上角 （起始点在下图中标记为“Start” ）。 
//
// 机器人每次只能向下或者向右移动一步。机器人试图达到网格的右下角（在下图中标记为“Finish”）。 
//
// 现在考虑网格中有障碍物。那么从左上角到右下角将会有多少条不同的路径？ 
//
// 
//
// 网格中的障碍物和空位置分别用 1 和 0 来表示。 
//
// 
//
// 示例 1： 
//
// 
//输入：obstacleGrid = [[0,0,0],[0,1,0],[0,0,0]]
//输出：2
//解释：
//3x3 网格的正中间有一个障碍物。
//从左上角到右下角一共有 2 条不同的路径：
//1. 向右 -> 向右 -> 向下 -> 向下
//2. 向下 -> 向下 -> 向右 -> 向右
// 
//
// 示例 2： 
//
// 
//输入：obstacleGrid = [[0,1],[0,0]]
//输出：1
// 
//
// 
//
// 提示： 
//
// 
// m == obstacleGrid.length 
// n == obstacleGrid[i].length 
// 1 <= m, n <= 100 
// obstacleGrid[i][j] 为 0 或 1 
// 
// Related Topics 数组 动态规划 
// 👍 450 👎 0


//leetcode submit region begin(Prohibit modification and deletion)
class Solution {
    //  think 1: 動態規劃， dp[i][j] = dp[i-1][j] + dp[i][j-1]
    //           子問題，(i, j)位置的總走法 ＝ 上一格的走法＋左邊一格的走法
    //  TC:O(MxN)
    //  SC:O(MxN)

    //  think 2[🚀]: 動態規劃， dp[i][j] = dp[i-1][j] + dp[i][j-1]
    //           子問題，(i, j)位置的總走法 ＝ 上一格的走法＋左邊一格的走法
    //           優化記憶體空間，只需要紀錄單排的陣列，每次透過前一排去算下一排的值
    //           遇到障礙物則值設為0
    //  TC:O(MxN)
    //  SC:O(N)
    public int uniquePathsWithObstacles(int[][] obstacleGrid) {
        int[] arr = new int[obstacleGrid[0].length];

        arr[0] = obstacleGrid[0][0] == 0 ? 1 : 0;
        for (int i = 0; i < obstacleGrid.length; i++) {
            for (int j = 0; j < obstacleGrid[0].length; j++) {
                if (obstacleGrid[i][j] == 1){
                    arr[j] = 0;
                } else if (j>0){
                    arr[j] += arr[j-1];
                }
            }
        }

        return arr[obstacleGrid[0].length - 1];
    }
}
//leetcode submit region end(Prohibit modification and deletion)
